[
    {
        "id": 1,
        "period": "Janvier 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_2_19122020.git",
        "title": "Reservia",
        "resume": "Réalisation d'un site web en HTML et CSS (uniqument) à partir d'une maquette donnée",
        "goal": "Transformer une maquette en site web",
        "scenario": "Enfin vous avez trouvé votre premier stage en tant que développeur web chez Reservia, une petite entreprise proposant un outil de planification de vacances. Leur site permet aux usagers de trouver des hébergements et des activités dans la ville de leur choix. Les hébergements peuvent également être filtrés par thématique, par exemple leur budget ou leur ambiance. Un nouveau design basé sur les principes du Material Design vient d'être proposé par Loïc, designer UI. Avant de valider définitivement ce design l'entreprise décide de réaliser un prototype. La première étape consiste à intégrer la maquette responsive en HTML et CSS. Voici donc la tâche qui vous est attribué ! Loïc vous envoie un mail pour vous en dire plus, en mettant en copie votre manager, Sarah, qui est CTO de l'entreprise.",
        "resources":  ["Maquettes desktop et mobile du site Reservia (PNG)", "Photographies (JPG)", "Logo (SVG)"],
        "contraintes" : ["Le site devra être adapté pour desktop, mobiles et tablettes. Pour les tablettes, adaptations libre.", "Choix du format d'image le plus adapté par rapport à la résolution et aut temps de chargement.", "Les icônes proviennent de la bibliothèque FONT AWESOME.", "Couleurs de la charte graphique : bleu #0065FC, bleu clair #DEEBFF, gris #F2F2F2", "La police du site est RALEWAY", "Ne pas utiliser de framework ou pré-compilateur CSS (comme SASS, par exemple)", "Utilisation de Flexbox ou CSS Grid", "Le code devra utiliser les balises sémantiques et ne doit contenir aucune erreur ni alerte au validateur W3C HTML et CSS", "Site compatible avec les dernières versions de Chrome et Firefox", "Séparer le code HTML du CSS"],
        "competences": ["Intégrer du contenu conformément à une maquette", "Utiliser un système de gestion de versions pour le suivi du projet et son hébergement", "Mettre en place un environnement Front-End", "Implémenter une interface responsive"],
        "languages": ["HTML","CSS", "VSCode"],
        "illustration": "img_reservia.png",
        "screenshot":"Reservia.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 2,
        "period": "Février 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_3_08012021.git",
        "title": "Ohmyfood",
        "resume": "Développement de pages web, pour des menus de restaurant, avec des animations css",
        "goal": "Dynamiser une page web avec des animations CSS",
        "scenario": "Vous venez d'être recruté chez Ohmyfood!, en tant que développeur junior. Ohmyfood! est une jeune startup qui voudrait s'imposer sur le marché de la restauration. L'objectif est de développer un site 100% mobile qui répertorie les menus de restaurants gastronomiques. En plus des systèmes classiques de réservation, les clients pourront composerle menu de leur repas pour que les plats soient prêts à leur arrivée. Finis, les temps d'attente au restaurant !",
        "resources":  ["4 menus de restaurant (TXT)","Brief créatif (PDF)","Maquettes du site (PNG)"],
        "contraintes" : ["Police logo et titres : Shrikhand", "Texte : Roboto", "Couleurs : Primaire #9356DC, Secondaire #FF79DA, Tertiaire #99E2D0", "Le développement devra se faire en CSS, sans JavaScript, ni librairie", "Aucun framework ne devra être utilisé, en revanche l'utilisation de SASS est un plus", "Aucun code CSS ne devra être appliqué via un attribut style dans une balise HTML", "Le site devra être développé en utilisant l'approche mobile-first.", "L'ensemble du site devra être responsive sur mobile, tablette et desktop", "Les pages devront passer la validation W3C en HTML et CSS sans erreur","Le site doit être compatible avec les dernières versions desktop de Chrome et Firefox", "Les effets au clic ou au survol devront utiliser les animations ou transitions CSS."],
        "competences": ["Mettre en place une structure de navigation pour un site web","Mettre en oeuvre des effets CSS graphiques avancés", "Assurer la cohérence graphique d'un site web"],
        "languages": ["HTML","Sass","CSS", "VSCode"],
        "illustration": "img_ohmyfood.png",
        "screenshot":"OhMyFood.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 3,
        "period": "Février 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/GameOn-website-FR.git",
        "title": "Game On",
        "resume": "Refactoring d'une landing page avec vanilla JS",
        "goal": "Créer une landing page avec JavaScript",
        "scenario": "Vous avez récemment été embauché comme développeur Front-End junior dans une PME, GameOn, spécialisée dans les conférences et les concours de jeux. Vous avez fait du shadowing de votre développeur principal, pour suivre son travail au quotidien. Jason a travaillé sur la nouvelle page d'accueil et d'inscription aux concours après avoir reçu des commentaires négatifs de la part de certains utilisateurs. Malheureusement, il n'a pas eu le temps de terminer avant de partir pour son nouveau poste dans sa nouvelle entreprise. Vous devez prendre le relais et compléter la partie Front-End.",
        "resources":  ["Maquettes (PDF)", "Lien vers le repo Git avec le code déjà réalisé", "Issues dans le repo Git"],
        "contraintes" : ["Travailler sur un repo Git forké", "Utiliser des fichiers séparés pour le HTML, CSS et le JavaScript","Commenter son code en décrivant chaque fonction et chaque classe, et les parties du code qui nécessitent plus de détails", "Tester manuellement les fonctionnalités, les entrées de formulaire et l'affichage responsive"],
        "competences": ["Programmer en JavaScript"],
        "languages": ["Javascript","HTML","Sass","CSS", "VSCode"],
        "illustration": "img_gameon.png",
        "screenshot":"GameOn.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 4,
        "period": "Avril 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_6_04032021.git",
        "title": "FishEye",
        "resume": "Création d'un site web accessible pour une plateforme de photographes",
        "goal": "Créer un site accessible pour une plateforme de photographes",
        "scenario": "Depuis quelques semaines, vous êtes développeur junior chez Teachasite, une société de conseil spécialisée dans le développement de sites web et d'applications mobiles. FishEye, un nouveau client, est un site web qui permet aux photographes indépendants, de présenter leurs meilleurs travaux. Ils ont récemmé levé des fonds et aimeraient mettre à jour leur site web.",
        "resources":  ["Notes de réunion détaillant les principales fonctionnalités et les exigences technique à metrre en oeuvre (PDF)", "Maquettes Figma", "Exemples de photos et de vidéos (JPG,MP4)","Exemples de données (JSON)"],
        "contraintes" : ["Le code est séparé en différents fichiers (HTML avec balises d'accessibilité, CSS, JavaScript", "Utilisation d'ESLint pour s'assurer que le code est robuste","Version moderne (ES6 ou supérieure) de JavaScript.","Utilisation de la Programmation Orientée Objet","Code lisible dans le choix des noms pour les variables, les fonctions et les classes","Construire le site conformément aux exigences d'accessibilité du client","Assurer la navigation au clavier", "Faire passer le code au vérificateur d'accessibilité (exemple : AChecker","Utilisation du pattern Factory Method"],
        "competences": ["Ecrire du code JavaScript maintenable", "Assurer l'accessibilité d'un site web","Gérer les évènements d'un site avec JavaScript","Développer une application web modulaire avec des design patterns"],
        "languages": ["Javascript","HTML","Sass","CSS", "VSCode"],
        "illustration": "img_fisheye.png",
        "screenshot":"FishEye.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 5,
        "period": "Mai 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_7_22042021.git",
        "title": "Les Petits Plats",
        "resume": "Développement d'un algorithme de recherche en JavaScript",
        "goal": "Développer un algorithme de recherche en JavaScript",
        "scenario": "Vous êtes freelance et vous venez d'être missioné par l'entreprise \"Les petits plats\" en tant que développeur Front-End pour une mission de 3 mois. Après avoir édité des livres de cuisine pendant plusieurs années, l'entrprise a décidé de se lancer dans un nouveau projet : réaliser son propre site de recettes de cuisine à l'instar de Marmiton ou 750g.",
        "resources":  ["Fichier JavaScript contenant un tableau JSON de 50 recettes (JS)","Cas d'utilisation du moteur de recherche (PDF)","Maquette Figma","Fiche d'investigation de fonctionnalités"],
        "contraintes" : ["Réaliser 2 versions d'algorithme du moteur de recherche","Créer un document de comparaison (fiche d'investigation)","Utilisation de Bootstrap 4 mais pas d'autres librairie","Le code doit passer avec succès le validateur W3C","Utiliser 1 branches Git par algorithme","Faire un test de performance avec JSBench"],
        "competences": ["Analyser un problème informatique","Développer un algorithme pour résoudre un problème"],
        "languages": ["Javascript","Bootstrap","HTML","Sass", "VSCode"],
        "illustration": "img_petits_plats.png",
        "screenshot":"LesPetitsPlats.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 6,
        "period": "Juin 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_9_24052021.git",
        "title": "Billed",
        "resume": "Debuggage et tests unitaire automatisé d'un SaaS RH",
        "goal": "Débugger et tester un Sass RH",
        "scenario": "Vous êtes développeur front-end chez Billed, une entreprise qui produit des solutions Saas destinées aux équipes de ressources humaines. Malheureusement pour Billed, Garance, une collègue de la feature team \"note de frais\" a quitté l'entreprise avant d'avoir terminé l'application. Dans une semaine, l'équipe doit montrerla solution qui fonctionne à l'ensemble de l'entreprise. Mathieu, Lead Developper de la feature team a demandé à être épaulé pour tenir les délais. Vous êtes désigné pour mettre en place les tests sur la fonctionnalité \"notes de frais\"",
        "resources":  ["Description des fonctionnalités (PDF)", "Repo Git du code à tester","Kanban Notion"],
        "contraintes" : ["Fixer les bugs fixés par la QA","Ajouter des tests unitaires d'intégration pour les fichiers Bills et NewBill","Réaliser un plan de test E2E pour la QA au format PDF", "Utilisation de JEST"],
        "competences": ["Débugger une application","Ecrire des tests d'intégration avec JavaScript","Ecrire des tests unitaires avec JavaScript","Rédiger un plan de test end-to-end manuel"],
        "languages": ["Jest","Javascript","HTML","CSS","VSCode"],
        "illustration": "img_billed.png",
        "screenshot":"Billed.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 8,
        "period": "Août 2021",
        "repo": 1,
        "url": "https://github.com/GitDrinou/SandrineBrival_11_30072021.git",
        "title": "Kasa",
        "resume": "Développement d'une application web avec ReactJS et React Router",
        "goal": "Développer une application web avec React et React Router",
        "scenario": "Kasa vous recrute en tant que développeur Front-end en freelance pour développer leur nouvelle plateforme web. Kasa est dans le métier de la location d'appartements entre particuliers depuis près de 10 ans. Avec plus de 500 annonces postées chaque jour Kasa fait partie des leaders de la location d'appartements entre particuliers en France. Le site de Kasa a été codé, il y a maintenant plus de 10 ans en ASP.NET avec un code legacy important. La CTO a lancé une refonte totale pour passer à une stack complète en JavaScript avec NodeJS côté back-end, et React côté front-end. Kasa a également profité pour commander de nouvelles maquettes auprès d'un designer freelance.",
        "resources":  ["Maquettes Figma","Fichier contenant les 20 dernières annonces (JSON)","Coding Guidelines (PDF)"],
        "contraintes" : ["Démarrer le projet React en développant l'ensemble de l'application : composants React, routes avec React Router","Pour le défilement des photos du composant Gallery, si l'utilisateur se trouve sur la première image et qu'il clique sur le bouton précédent, la gallerie affichera la dernière image et inversement. S'il n'y a qu'une seule image les boutons précédent et suivant n'apparaissent pas.", "La gallerie doit toujours rester de la même hauteur : réajuster les photos", "Par défault, les collapse sont fermés à l'initialisation de la page","Si le collapse est ouvert, lorsque l'utilisateur clique dessus celui-ci le ferme et inversement."],
        "competences": ["Créer des composants avec React","Développer les routes d'une application web avec React Router","Initialiser une application web avec un framework"],
        "languages": ["Javasript","HTML","Sass","CSS", "VSCode"],
        "illustration": "img_kasa.png",
        "screenshot":"Kasa.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 13,
        "period": "Juillet 2025",
        "repo": 1,
        "url": "https://github.com/GitDrinou/DAPython_P02_Task_Task_Automation.git",
        "title": "Scrapping Books",
        "resume":"Développer un programme en Python (scrapper)",
        "goal": "Gérer les données à l'aide du processus ETL",
        "scenario": "Analyste marketing chez Books Online, librairie en ligne spécialisée dans les livres d'occasions, il est demandé de réaliser un programme Python (= scraper) permettant d'extraire les infos tarifaires des concurrents (sites en ligne) et notamment https://books.toscrape.com/. Le programme permet d'extraire les données d'un produit, les données de produits d'une catégorie et les produits de toutes les catégories.",
        "resources":  ["Exigences du système de surveillance des prix"],
        "contraintes" : [],
        "competences": ["Gérer les données à l'aide du processus ETL", "Utiliser le contrôle de version avec Git et GitHub", "Appliquer les bases de programmation en Python", "Configurer un environnement Python"],
        "languages": ["Python","PyCharm"],
        "illustration": "img_scraping_books.png",
        "screenshot":"Scrapping_books.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 14,
        "period": "Août 2025",
        "repo": 0,
        "url": "https://wax-enemy-cd2.notion.site/23efbb1a73cd8066b899e5d9498ac26b?v=23efbb1a73cd81efaf22000cddad1cb2",
        "title": "HomeSkolar",
        "resume":"Designer une application Python adaptée aux besoins d'un client",
        "goal": "Définir les exigences fonctionnelles de l'application à partir d'un besoin client",
        "scenario": "Lead dev d'une équipe de l'entité web chez CodeIguanas, entreprise du numérique avec plusieurs entitée de développement d'applications mobile et sites web.\nLe client est HomeSkolar, une association mettant en relation des enfants en difficultés scolaire et des tuteurs bénévoles.",
        "resources":  ["Notes de réunion (besoin client)"],
        "contraintes" : [],
        "competences": ["Réaliser une veille technologique", "Utiliser la modélisation UML et les diagrammes de classe",
            "Rédiger un cahier des charges détaillé et des spécification techniques", "Élaborer un backlog produit avec des user stories", "Rédiger une présentation"],
        "languages": ["Word","Notion", "Diagramme de classe", "Google Slide"],
        "illustration": "img_codeinguanas.png",
        "screenshot":"home_skolar.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 15,
        "period": "Octobre 2025",
        "repo": 1,
        "url": "https://github.com/GitDrinou/DAPython_P04_Chess_Tournament.git",
        "title": "Chess tournament",
        "resume":"Développer un programme Python pour la gestion de tournois d'échec.",
        "goal": "Ecrire un code Python robuste en utilisant PEP8 et en le structurant avec un design pattern",
        "scenario": "Le club d'échecs local souhaite développer son propre logiciel pour gérer les tournois. Le programme suit le concept MVC, comprenant 3 entités principales: Tournois, Joueurs, Tours",
        "resources":  ["Document des spécifications techniques"],
        "contraintes" : ["Programme fonctionnant hors ligne"],
        "competences": ["Ecrire du code respectant les standards PEP8", "Utilisation de la programmation orientée objet",
            "Application du design pattern MVC"],
        "languages": ["Python","Flake8", "Diagramme de classe", "MVC"],
        "illustration": "img_chess_tournament.png",
        "screenshot":"chess_tournament.webp",
        "from_label": "OpenClassrooms"
    },
    {
        "id": 16,
        "period": "Novembre 2025",
        "repo": 1,
        "url": "https://github.com/GitDrinou/DAPython_P06_Just_Stream_It.git",
        "title": "JustStreamIt",
        "resume":"Développer une application web affichant le classement de film par catégorie",
        "goal": "Développer la partie Front-End d'une application avec HTML, CSS et Javascript, en intéragissant avec une API REST",
        "scenario": "Pour monter en croissance, l'association JustStrreamIt souhaite se doter d'une application web permettant de visualiser en temps réel un classement de films intéressants.",
        "resources":  ["Cahier des charges", "Maquette Figma","Dépôt Git API"],
        "contraintes" : ["Application fonctionne sur les 3 principaux navigateurs", "Application responsive", "Pas d'utilisation de framework"],
        "competences": ["Ecrire du code HTML, CSS et Javascript", "Intéraction avec une API REST"],
        "languages": ["HTML","CSS", "Javascript", "Figma"],
        "illustration": "img_streamit.png",
        "screenshot":"justStreamIt.webp",
        "from_label": "OpenClassrooms"
    }
]


